In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data=pd.DataFrame(np.arange(16).reshape(4,-1),
                 index=['India','US','Germany','UK'],
                 columns=['one','two','three','four'])

In [4]:
data

         one  two  three  four
India      0    1      2     3
US         4    5      6     7
Germany    8    9     10    11
UK        12   13     14    15

In [5]:
# data[0]

#indexing doesnt work on dataFrames

#slicing works

In [6]:
data[0:2]

       one  two  three  four
India    0    1      2     3
US       4    5      6     7

In [7]:
#data['India']

#you cant index using the name like above for DataFrames. You can do it for columns like data['one'] etc.

In [8]:
data['India':'UK']

         one  two  three  four
India      0    1      2     3
US         4    5      6     7
Germany    8    9     10    11
UK        12   13     14    15

#AS said above slicing works on the indexes.

In [9]:
data

         one  two  three  four
India      0    1      2     3
US         4    5      6     7
Germany    8    9     10    11
UK        12   13     14    15

In [10]:
data['one']

India       0
US          4
Germany     8
UK         12
Name: one, dtype: int64

# Boolean conditioning

In [11]:
data[data['one']>5]

         one  two  three  four
Germany    8    9     10    11
UK        12   13     14    15

In [12]:
data[data['one']>13]

Empty DataFrame
Columns: [one, two, three, four]
Index: []

#no o/p because all the values in 'one' column is less than 13 hence vo o/p

In [13]:
data.loc['India']

one      0
two      1
three    2
four     3
Name: India, dtype: int64

In [14]:
data.loc['India','three']

2

In [15]:
data.iloc[0]

one      0
two      1
three    2
four     3
Name: India, dtype: int64

#iloc[] is used for integer indexes.

In [16]:
#iloc[0] is same as loc['India']

In [17]:
data.iloc[:]

         one  two  three  four
India      0    1      2     3
US         4    5      6     7
Germany    8    9     10    11
UK        12   13     14    15

In [18]:
#to get column data too we use below formula

In [19]:
data.iloc[:,1]

India       1
US          5
Germany     9
UK         13
Name: two, dtype: int64

In [20]:
#will only get 2nd column data only.

In [21]:
data.iloc[3,1]

13

In [22]:
data.iloc[0:2,0:2]

       one  two
India    0    1
US       4    5

In [23]:
data.iloc[:,:3]

         one  two  three
India      0    1      2
US         4    5      6
Germany    8    9     10
UK        12   13     14

In [24]:
data.iloc[:,:3][data<10]

         one  two  three
India    0.0  1.0    2.0
US       4.0  5.0    6.0
Germany  8.0  9.0    NaN
UK       NaN  NaN    NaN

In [25]:
data.iloc[:,:5][data<10]

         one  two  three  four
India    0.0  1.0    2.0   3.0
US       4.0  5.0    6.0   7.0
Germany  8.0  9.0    NaN   NaN
UK       NaN  NaN    NaN   NaN

In [26]:
df=pd.DataFrame(np.random.randn(5,3),index=['a','b','e','f','g'],columns=['one','two','three'])

In [27]:
df

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196

In [28]:
#creating NaN values

In [29]:
df2=df.reindex(['a','b','c','d','e','f','g','h'])

In [30]:
df

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196

In [31]:
df2

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c       NaN       NaN       NaN
d       NaN       NaN       NaN
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h       NaN       NaN       NaN

In [32]:
#filling NaN values

In [33]:
df3=df2.fillna(0)

In [34]:
df3

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c  0.000000  0.000000  0.000000
d  0.000000  0.000000  0.000000
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h  0.000000  0.000000  0.000000

In [35]:
df2

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c       NaN       NaN       NaN
d       NaN       NaN       NaN
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h       NaN       NaN       NaN

In [36]:
df4=df2.fillna(method='bfill',axis=0)

In [37]:
df4

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c -0.571955  0.739790  1.635676
d -0.571955  0.739790  1.635676
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h       NaN       NaN       NaN

#bfill method fill in the NaN values with the values which come afterwards.
#Hence in df2 c & d are empty. In df4 c&d are filled with values from e.
#h is empty because there are no values after h.

In [38]:
df2

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c       NaN       NaN       NaN
d       NaN       NaN       NaN
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h       NaN       NaN       NaN

In [39]:
df4=df2.fillna(method='ffill',axis=0)

In [40]:
df4

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c  0.325626 -0.442003 -0.059577
d  0.325626 -0.442003 -0.059577
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h  1.404696 -0.398460  1.130196

#ffill method fill in the NaN values with the values which come before.
#Hence in df2 c & d are empty. In df4 c&d are filled with values from b.

In [41]:
df5=df2.fillna(method='ffill',axis=1).fillna(10)

In [42]:
df5

         one        two      three
a  -0.999103   1.295267   1.199880
b   0.325626  -0.442003  -0.059577
c  10.000000  10.000000  10.000000
d  10.000000  10.000000  10.000000
e  -0.571955   0.739790   1.635676
f   1.220509   0.588440   0.721488
g   1.404696  -0.398460   1.130196
h  10.000000  10.000000  10.000000

In [43]:
df2

        one       two     three
a -0.999103  1.295267  1.199880
b  0.325626 -0.442003 -0.059577
c       NaN       NaN       NaN
d       NaN       NaN       NaN
e -0.571955  0.739790  1.635676
f  1.220509  0.588440  0.721488
g  1.404696 -0.398460  1.130196
h       NaN       NaN       NaN

In [44]:
#inplace= True will change the original dataframe if not the change is temporary.

In [45]:
df6=df2.fillna(25,inplace=True)

In [46]:
df6

In [47]:
df2

         one        two      three
a  -0.999103   1.295267   1.199880
b   0.325626  -0.442003  -0.059577
c  25.000000  25.000000  25.000000
d  25.000000  25.000000  25.000000
e  -0.571955   0.739790   1.635676
f   1.220509   0.588440   0.721488
g   1.404696  -0.398460   1.130196
h  25.000000  25.000000  25.000000